(function () {
  const JOB_CODES = {
    '1': '검술사',
    '2': '격투사',
    '3': '도끼술사',
    '4': '창술사',
    '5': '궁술사',
    '6': '환술사',
    '7': '주술사',
    '8': '목수',
    '9': '대장장이',
    'a': '갑주제작사',
    'b': '보석공예가',
    'c': '가죽공예가',
    'd': '재봉사',
    'e': '연금술사',
    'f': '요리사',
    '10': '광부',
    '11': '원예가',
    '12': '어부',
    '13': '나이트',
    '14': '몽크',
    '15': '전사',
    '16': '용기사',
    '17': '음유시인',
    '18': '백마도사',
    '19': '흑마도사',
    '1a': '비술사',
    '1b': '소환사',
    '1c': '학자',
    '1d': '쌍검사',
    '1e': '닌자',
    '1f': '기공사',
    '20': '암흑기사',
    '21': '점성술사',
    '22': '사무라이',
    '23': '적마도사'
  }

  const CARD_PREFERENCE = {
    '아제마의 균형': {
      love: 'all',
      hate: 'none'
    },

    '세계수의 줄기': {
      love: ['검술사', '도끼술사'],
      hate: 'none'
    },

    '오쉬온의 화살': {
      love: [],
      hate: []
    },

    '할로네의 창': {
      love: [],
      hate: []
    },
    '살리아크의 물병': {
      love: [],
      hate: []
    },
    '비레고의 탑': {
      love: [],
      hate: []
    }
  }

  window.JOB_CODES = JOB_CODES
  window.CARD_PREFERENCE = CARD_PREFERENCE
})()