(function () {
  const JOB_NAMES = {
    '1': '검술사',
    '2': '격투사',
    '3': '도끼술사',
    '4': '창술사',
    '5': '궁술사',
    '6': '환술사',
    '7': '주술사',
    '8': '목수',
    '9': '대장장이',
    'a': '갑주제작사',
    'b': '보석공예가',
    'c': '가죽공예가',
    'd': '재봉사',
    'e': '연금술사',
    'f': '요리사',
    '10': '광부',
    '11': '원예가',
    '12': '어부',
    '13': '나이트',
    '14': '몽크',
    '15': '전사',
    '16': '용기사',
    '17': '음유시인',
    '18': '백마도사',
    '19': '흑마도사',
    '1a': '비술사',
    '1b': '소환사',
    '1c': '학자',
    '1d': '쌍검사',
    '1e': '닌자',
    '1f': '기공사',
    '20': '암흑기사',
    '21': '점성술사',
    '22': '사무라이',
    '23': '적마도사'
  }

  const BUFF_PREFERENCE = {
    '아제마의 균형': {
      love: 'all',
      hate: 'none'
    },

    '세계수의 줄기': {
      love: ['검술사', '도끼술사', '나이트','전사', '암흑기사'],
      hate: 'none'
    },

    '오쉬온의 화살': {
      love: ['환술사', '주술사', '백마도사', '흑마도사', '사무라이'],
      hate: ['격투사', '궁술사', '몽크', '음유시인', '쌍검사', '닌자', '기공사']
    },

    '할로네의 창': {
      love: 'all',
      hate: 'none'
    },

    '살리아크의 물병': {
      love: ['궁술사', '환술사', '주술사', '음유시인', '백마도사', '흑마도사', '비술사', '소환사', '학자', '점성술사', '적마도사'],
      hate: ['검술사', '격투사', '도끼술사', '창술사', '나이트', '몽크', '전사', '용기사', '쌍검사', '닌자', '기공사', '암흑기사', '사무라이']
    },

    '비레고의 탑': {
      love: ['검술사', '격투사', '도끼술사', '창술사', '궁술사', '나이트', '몽크', '전사', '용기사', '음유시인', '쌍검사', '닌자', '기공사', '암흑기사', '사무라이'],
      hate: ['환술사', '주술사', '백마도사', '흑마도사', '비술사', '소환사', '학자', '점성술사', '적마도사']
    }
  }

  window.JOB_NAMES = JOB_NAMES
  window.BUFF_PREFERENCE = BUFF_PREFERENCE
})()
